{
    "38": {
        "name": "L'Aventure Chloe 2014",
        "grape": null,
        "region": "Paso Robles, Central Coast, California",
        "variety": "Red Wine",
        "rating": 97.0,
        "notes": "Blend: 67% Syrah, 33% Old Vine Grenache "
    },
    "39": {
        "name": "L'Aventure Cote A Cote 2006",
        "grape": null,
        "region": "Paso Robles, Central Coast, California",
        "variety": "Red Wine",
        "rating": 96.0,
        "notes": "Blend: 40% Mourvedre, 30% Grenache, 30% Syrah"
    },
    "40": {
        "name": "L'Aventure Cote A Cote 2007",
        "grape": null,
        "region": "Paso Robles, Central Coast, California",
        "variety": "Red Wine",
        "rating": 95.0,
        "notes": "40% Mourvedre estate, 40% Grenache estate, 20% Syrah estate. Ruby in color with garnet edges, the aromas are diverse, with a spice bouquet, mineral notes, and blueberries leading the way. The attack on the palate is vibrant, with rich violet and wild berry flavors standing over a stream of cherry, pomegranate, and tar. The finish is opulent, with vanilla spice sounding a final note. "
    },
    "42": {
        "name": "L'Aventure Cote A Cote 2011",
        "grape": null,
        "region": "Central Coast, California",
        "variety": "Red Wine",
        "rating": 96.0,
        "notes": "Ruby in color. Intensely floral nose of violets, jasmine, and soft red fruit. A firm attack of vinous, mineral, citrus and soft, round, red fruit. Brilliant Syrah flavors. Smoky, peppery, toasty finish with cardamom notes. This is an excellent Cote a Cote that will be enjoyed immensely at table."
    },
    "43": {
        "name": "L'Aventure Cote A Cote 2014",
        "grape": null,
        "region": "Paso Robles, Central Coast, California",
        "variety": "Red Wine",
        "rating": 96.0,
        "notes": "Blend: 50% Grenache, 28% Mourvedre, 22% Syrah"
    },
    "44": {
        "name": "L'Aventure Cote A Cote (slightly stained labels) 2012",
        "grape": null,
        "region": "Paso Robles, Central Coast, California",
        "variety": "Red Wine",
        "rating": 96.0,
        "notes": "Blend: 60% Grenache, 30% Mourvedre, 10% Syrah"
    },
    "46": {
        "name": "L'Aventure Estate Cuvee 2004",
        "grape": null,
        "region": "Paso Robles, Central Coast, California",
        "variety": "Red Wine",
        "rating": 98.0,
        "notes": "This wonderfully \"juicy\" 2004 Estate Cuvee is unique in that a percentage of the blend was \"co–fermented,\" due to the fact that all three of the varieties that comprise Estate Cuvee - Cabernet Sauvignon, Syrah, and Petit Verdot - arrived at maturity simultaneously. For the first time in his 24 years as a wine maker, Stephan saw these grapes fermenting in the same tank. The result is a seamless, complex work of art. Fresh aromas of plums, macerated blackberries, and blueberries in the nose, and dark, intense fruit on the palate. The mouth and lengthy finish are made more complex by hints of leather, tar, and tobacco leaf. An augmentation of Petit Verdot puts the 2004 on the classic track of the 2001 vintage."
    },
    "47": {
        "name": "L'Aventure Estate Cuvee 2005",
        "grape": null,
        "region": "Paso Robles, Central Coast, California",
        "variety": "Red Wine",
        "rating": 96.0,
        "notes": "Blend: 52% Syrah, 40% Cabernet Sauvignon, 8% Petit Verdot"
    },
    "48": {
        "name": "L'Aventure Estate Cuvee 2006",
        "grape": null,
        "region": "Paso Robles, Central Coast, California",
        "variety": "Red Wine",
        "rating": 97.0,
        "notes": "\"A thrilling, nearly perfect efforts is the 2006 Estate Cuvee. A blend of 49% Syrah, 37% Cabernet Sauvignon, and 4% Petit Verdot, the 2006 Estate Cuvee may be even better. Tasting like a superb example of a premier grand cru St.-Emilion made from California-s limestone soils, it exhibits a dense purple color as well as a perfume of sweet creme de cassis, fruitcake, licorice, incense, tobacco leaf, and spice box. A voluptuous texture, fabulous opulence, and thrilling concentration as well as purity make for a prodigious example of blended red wine that will provide enormous pleasure and complexity for 12-15+ years."
    },
    "49": {
        "name": "L'Aventure Estate Cuvee 2007",
        "grape": null,
        "region": "Central Coast, California",
        "variety": "Red Wine",
        "rating": 95.0,
        "notes": "49% Syrah estate, 37% Cabernet Sauvignon estate, 14% Petit Verdot estate. Opaque ebony center, purple margins. Powerful, complex aromas of graphite, \"viande\", dark fruit, licorice, tea-leaf...have we forgotten anything? Spicy notes introduced in the aroma linger like cloves and sage in a rich tapestry of flavors that include wild blackberry, tar, gooseberry, and acacia. The length of the finish is memorable. You really need to try this wine for yourself– words do not do it justice! "
    },
    "53": {
        "name": "L'Aventure Estate Cuvee 2013",
        "grape": null,
        "region": "Central Coast, California",
        "variety": "Red Wine",
        "rating": 97.0,
        "notes": "The most densely colored of all wines in a vintage of great extraction; Estate Cuvee exhibits a powerful perfume of anise, lavender candies, and dark fruit, with smoky accents in the background. The attack isimpressive, with a velvety mouth feel from start to finish. Rich, robust blue and black fruit, with hints of cocoa,big, but with soft resolved tannins, give a \"total\" palate experience in the finish."
    },
    "54": {
        "name": "L'Aventure Estate Cuvee 2012",
        "grape": null,
        "region": "Paso Robles, Central Coast, California",
        "variety": "Red Wine",
        "rating": 98.0,
        "notes": "The most densely colored of all wines in a vintage of great extraction; Estate Cuvée 2012 exhibits a powerful perfume of anise, lavender candies, and dark fruit, with smoky accents in the background. The attack is impressive, with a velvety mouth feel from start to finish. Rich, robust blue and black fruit, with hints of cocoa, big, but with soft resolved tannins, give a \"total\" palate experience in the finish. "
    },
    "55": {
        "name": "L'Aventure Estate Cuvee 2014",
        "grape": null,
        "region": "Central Coast, California",
        "variety": "Red Wine",
        "rating": 98.0,
        "notes": "Blend: 50% Cabernet Sauvignon, 35% Syrah, 15% Petit Verdot"
    },
    "56": {
        "name": "L'Aventure Estate Cuvee 2016",
        "grape": null,
        "region": "Paso Robles, Central Coast, California",
        "variety": "Red Wine",
        "rating": 99.0,
        "notes": "Blend: 52% Syrah, 32% Cabernet Sauvignon, 16% Petit Verdot"
    },
    "59": {
        "name": "L'Aventure Optimus 2007",
        "grape": null,
        "region": "Central Coast, California",
        "variety": "Red Wine",
        "rating": 95.0,
        "notes": "45% Cabernet Sauvignon, 40% Syrah, 15% Petit Verdot. Our best Optimus ever.  Ruby color, with soft aromas of candied currants, fir, and cardamom. A very sharp attack of somewhat high–tone red fruit on the palate cedes to blueberries, black currant, and spicy notes which finish long. 1,400 cases produced "
    },
    "119": {
        "name": "Le Chiuse Brunello di Montalcino 2013",
        "grape": null,
        "region": "Montalcino, Tuscany, Italy",
        "variety": "Red Wine",
        "rating": 96.0,
        "notes": "Ruby red in color with light granite hues. The nose is clean, elegant, and prevalent of fruity notes such as ripe plum and wild cherry mainly; with agreeable scents of flint, balsamic notes, violet and spices. All these fragrances make the bouquet complex and harmonic. Greatly structured, sapid and agreeably fresh. Its great acidity makes this wine very charming and elegant. The sunny vintage makes high density tannins but never too aggressive. The result is an important and elegant wine with a long and persistent finish. "
    },
    "120": {
        "name": "Le Chiuse Brunello di Montalcino 2015",
        "grape": null,
        "region": "Montalcino, Tuscany, Italy",
        "variety": "Red Wine",
        "rating": 95.0,
        "notes": "Ruby red in color with light granite hues. The nose is clean, elegant, and prevalent of fruity notes such as ripe plum and wild cherry mainly; with agreeable scents of flint, balsamic notes, violet, and spices. All these fragrances make the bouquet complex and harmonic. Greatly structured, sapid and agreeably fresh. Its great acidity makes this wine very charming and elegant. The sunny vintage makes high-density tannins but never too aggressive. The result is an important and elegant wine with a long and persistent finish"
    },
    "122": {
        "name": "Le Chiuse Brunello di Montalcino (375ML half-bottle) 2013",
        "grape": null,
        "region": "Montalcino, Tuscany, Italy",
        "variety": "Red Wine",
        "rating": 96.0,
        "notes": "Ruby red in color with light granite hues. The nose is clean, elegant, and prevalent of fruity notes such as ripe plum and wild cherry mainly; with agreeable scents of flint, balsamic notes, violet and spices. All these fragrances make the bouquet complex and harmonic. Greatly structured, sapid and agreeably fresh. Its great acidity makes this wine very charming and elegant. The sunny vintage makes high density tannins but never too aggressive. The result is an important and elegant wine with a long and persistent finish. "
    },
    "155": {
        "name": "Le Dome 2016",
        "grape": null,
        "region": "St. Emilion, Bordeaux, France",
        "variety": "Red Wine",
        "rating": 98.0,
        "notes": "Blend: 80% Cabernet Franc, 20% Merlot"
    },
    "222": {
        "name": "Le Potazzine Gorelli Brunello di Montalcino 2012",
        "grape": null,
        "region": "Montalcino, Tuscany, Italy",
        "variety": "Red Wine",
        "rating": 96.0,
        "notes": "Bright red garnet color and shiny. Strong olfactory elegance, dominated by a dense undergrowth but with wrap around reflection of sweet spices, hints of tobacco and coffee. A harmonious taste; well integrated alcohol. Tannins are rightly persistent, fine and round with a long, balanced finish."
    },
    "261": {
        "name": "Le Salette Pergole Vece Amarone 2015",
        "grape": null,
        "region": "Veneto, Italy",
        "variety": "Red Wine",
        "rating": 95.0,
        "notes": "Ruby red with violet reflections. Intense and complex nose with aromas of ripe fruit, prune, forest floor, licorice, black pepper and coffee. Concentrated with great structure, elegant and harmonious which finishes with long herbaceous notes. Ideal with roasted and grilled meat, game or mature cheeses; excellent meditation wine."
    },
    "264": {
        "name": "Le Vieux Donjon Chateauneuf-du-Pape (1.5 Liter Magnum) 2003",
        "grape": null,
        "region": "Chateauneuf-du-Pape, Rhone, France",
        "variety": "Red Wine",
        "rating": 95.0,
        "notes": "\"A very strong vintage for this traditionally made Chateauneuf du Pape, the 2003, a blend of 80% Grenache, 10% Syrah, and the rest Mourvedre and Cinsault, has a deep ruby\/plum\/purple color and a big sweet nose of dried Provencal herbs, licorice, seaweed, and spice box. The wine is massively concentrated, relatively high in alcohol by the standards here (15% plus on their component parts), and has a long, concentrated, chewy finish with high tannin and equally high extract. If there is one Chateauneuf du Pape that smells like an open-air Provencal spice, flower, and food market, it is Vieux Donjon. It is a classic, concentrated essence of Provence, all in an alcoholic beverage. This wine will need 4-5 years of cellaring when released and drink well for 15-20 years.\""
    },
    "271": {
        "name": "Le Vieux Donjon Chateauneuf-du-Pape 2007",
        "grape": null,
        "region": "Chateauneuf-du-Pape, Rhone, France",
        "variety": "Red Wine",
        "rating": 96.0,
        "notes": "70% Grenache; 20% Syrah; 10% Cinsault and Mourvedre."
    },
    "319": {
        "name": "Lecheneaut Nuits-St. Georges Damodes Premier Cru 2016",
        "grape": null,
        "region": "Burgundy, France",
        "variety": "Red Wine",
        "rating": 95.0,
        "notes": "The freshness and the purity of fruit combine with a fine structure, tender and supple. Easily approachable in its youth, it surprises by its capacity to assert its personality during ageing."
    },
    "320": {
        "name": "Lecheneaut Nuits-St-Georges Les Pruliers Premier Cru 2015",
        "grape": null,
        "region": "Nuits-St-Georges, Cote de Nuits, Cote d'Or, Burgundy, France",
        "variety": "Red Wine",
        "rating": 95.0,
        "notes": "Les Pruliers display a strong color. Young, it imposes its personality. Fresh red fruit aromas mingle with fine plant fragrances evoking wild prunes as well as notes of licorice and spiced roses. Mature, depth and roundness mask a strict final frame. You will perceive aromas of cocoa, smoked meat, and undergrowth. Age brings forth a generous and sensual smoothness."
    },
    "533": {
        "name": "Legacy Red 2013",
        "grape": null,
        "region": "Alexander Valley, Sonoma County, California",
        "variety": "Red Wine",
        "rating": 95.0,
        "notes": "The 2013 Red Wine exhibits a superb balance between richness and structural integrity. On the nose, aromas of cassis, cherry liqueur, wild fennel and cocoa nib flood from the glass alongside a faint hint of bay leaf. The palate delivers a fragrant blueberry and blackberry core supported by sleekly coiled tannins and graceful minerality. Extraordinarily layered, powerful and complex, this wine will age easily for two decades.The Legacy Red Wine assembles Bordeaux varieties from superior blocks in the Jimtown vineyard and Alexander Mountain Estate. Cabernet Sauvignon predominates, with smaller amounts of Cabernet Franc, Malbec, and Petit Verdot adding greater aromatic complexity and depth. An uncompromising attention to detail defines this wine, from pruning and leafing decisions to the final blend. Hand-picked at dawn and sorted by hand, the grapes are vinified in small upright fermenters made of French oak. After blending, the wine is aged for 26 months in 62% new French oak barrels before bottling."
    },
    "597": {
        "name": "Leonetti Merlot 2003",
        "grape": null,
        "region": "Walla Walla Valley, Columbia Valley, Washington",
        "variety": "Red Wine",
        "rating": 95.0,
        "notes": "The wine jumps from the glass with a brilliant, high-toned fruit nose of flowers, freshly cut fruit, and cherry liqueur backed with subtle, integrated spicy oak. This classic Leonetti Merlot presents soft but dense sweet fruit on the pallet as fully ripe, mellow tannins disappear into a long, seamless finish."
    },
    "613": {
        "name": "Leonetti Reserve 2005",
        "grape": null,
        "region": "Walla Walla Valley, Columbia Valley, Washington",
        "variety": "Red Wine",
        "rating": 97.0,
        "notes": "Having a beautiful saturated color, the wine's nose is enchanting ith a complex potpourri of rich, ripe sweet black fruits, plum, and spicebox with hints of beautiful herbs de Provence. The palate of the wine is structured with fine-grained smooth tannins and notes of mineral, creme cassis, and finishes very long with monumental purity. "
    },
    "621": {
        "name": "Leonetti Reserve (torn label) 2007",
        "grape": null,
        "region": "Walla Walla Valley, Columbia Valley, Washington",
        "variety": "Red Wine",
        "rating": 96.0,
        "notes": "A blend of the best lots from Mill Creek Upland, Seven Hills and Loess vineyards, this Cab-dominated blend also includes 12% Petit Verdot, 11% Malbec and 2% Merlot. It's quite slick on the palate, with good texture from well-integrated tannins. The fruit is dark and brooding - black cherry and wild blackberry - with a hint of rose, smoke and cedar. "
    },
    "672": {
        "name": "Les Vignerons de Tautavel Cotes du Roussillon Villages Tautavel Silex 2012",
        "grape": null,
        "region": "Cotes du Roussillon-Tautavel, Côtes du Roussillon-Villages, Roussillon, South of France, France",
        "variety": "Red Wine",
        "rating": 95.0,
        "notes": "A powerful red color. On the nose,  soft spices with intense mouth. Excellent with bourguignon beef and lamb."
    },
    "692": {
        "name": "Levy & McClellan Proprietary Red 2004",
        "grape": null,
        "region": "Napa Valley, California",
        "variety": "Red Wine",
        "rating": 95.0,
        "notes": "Full-bodied yet beautifully silky and seductive, it has shed most of its tannins, resulting in a complex, singular red wine of majestic proportions."
    },
    "693": {
        "name": "Levy & McClellan Proprietary Red 2005",
        "grape": null,
        "region": "Napa Valley, California",
        "variety": "Red Wine",
        "rating": 95.0,
        "notes": "Uncompromising viticultural practices andmeticulously detailed vinification rewarded us with a wine ofgreat concentration and ripeness. The round supple tanninsin the 2005 Levy & McClellan are the result of thecool growing conditions and the extended ripening. As the wine develops, the expression of the site where it is grown continues to come to the forefront. Accentuated by the low yield in a year known for more generosity, combined with26 months in barrel, the result is a profoundly concentrated, supple and full-bodied wine."
    },
    "698": {
        "name": "Lewelling Cabernet Sauvignon 2007",
        "grape": null,
        "region": "St. Helena, Napa Valley, California",
        "variety": "Red Wine",
        "rating": 95.0,
        "notes": "Intense black cherry, plum, and berry aromas intermingled with notes of anise, pain grille, and cedar. Rich cherry, red plum and raspberry flavors; white pepper, tobacco, and allspice; full-bodied with sweet, chewy tannins, balanced ripeness and fresh acidity."
    },
    "705": {
        "name": "Lewelling Wight Vineyard Cabernet Sauvignon 2009",
        "grape": null,
        "region": "St. Helena, Napa Valley, California",
        "variety": "Red Wine",
        "rating": 95.0,
        "notes": "Bouquet of enticing raspberry, cassis, and red plum aromas mixed with notes of chocolate and toasty oak. Flavors are rich blueberry, Bing cherry, and red raspberry flavors are also mingled with woodsmoke, earth, and spice; mouthfilling, velvety tannins and a complex, lingering finish."
    },
    "706": {
        "name": "Lewelling Wight Vineyard Cabernet Sauvignon 2008",
        "grape": null,
        "region": "Napa Valley, California",
        "variety": "Red Wine",
        "rating": 98.0,
        "notes": "Sumptuous aromas of blackberry, cassis, Bing cherry and spice mixed with highlights of tobacco, cedar, vanilla and anise. Concentrated black plum, black cherry, and cassis flavors; allspice, dark cocoa, juniper and sweet smoke; exceptional depth and complexity; multi-layered richness; mouthfilling, velvety tannins and a lingering finish."
    },
    "707": {
        "name": "Lewelling Wight Vineyard Cabernet Sauvignon 2007",
        "grape": null,
        "region": "St. Helena, Napa Valley, California",
        "variety": "Red Wine",
        "rating": 98.0,
        "notes": "An enticing mix of black fruit, tobacco and toasty oak aromas mingled with highlights of vanilla, cedar and licorice.  Concentrated black cherry, cassis, blueberry pie and espresso flavors; sweet smoke, anise and cedar; mouth-filling complexity and layered richness; dense but polished tannins and a very long finish."
    },
    "709": {
        "name": "Lewis Cellars Alec's Blend Red 2002",
        "grape": null,
        "region": "Napa Valley, California",
        "variety": "Red Wine",
        "rating": 96.0,
        "notes": "Number 12 on"
    },
    "724": {
        "name": "Lewis Cellars Cabernet Sauvignon 2002",
        "grape": null,
        "region": "Napa Valley, California",
        "variety": "Red Wine",
        "rating": 96.0,
        "notes": "Showcasing the unique personalities of small hillside vineyards from Pritchard Hill, Oakville and Rutherford, the 2002 Napa Valley Cabernet delivers compelling aromas of mocha, ripe berries, tobacco and sweet oak spice. The wine is 100% Cabernet Sauvignon, complex, rich and focused. With a deep core of black fruit and traces of briar and vanilla, it turns chocolaty and long on the palate with serious, integrated tannins."
    },
    "730": {
        "name": "Lewis Cellars Cabernet Sauvignon 2013",
        "grape": null,
        "region": "Napa Valley, California",
        "variety": "Red Wine",
        "rating": 95.0,
        "notes": "#1"
    },
    "732": {
        "name": "Lewis Cellars Cuvee L 2005",
        "grape": null,
        "region": "Napa Valley, California",
        "variety": "Red Wine",
        "rating": 95.0,
        "notes": "Think of Cuvee L as super-charged Lewis Reserve Cabernet. Red wine at red-line. First created from the spectacular 1997 vintage, the single best barrels from our finest lots fuel this rare wine. Cuvee L is not produced every year. It is only blended when we have the components to create a wine of greater intensity, depth and distinction than our Reserve Cabernet. "
    },
    "734": {
        "name": "Lewis Cellars Cuvee L Cabernet Sauvignon 2014",
        "grape": null,
        "region": "Napa Valley, California",
        "variety": "Red Wine",
        "rating": 95.0,
        "notes": "Our 2014 Cuvee L carries a cargo of fruit more laden than a Spanish galleon. Awash with crushed berries, clove and black truffle the wine superbly melds redolent ripe fruit with sweet oak spices. Broad and round on entry, this 100% Cabernet Sauvignon swells at mid-palate and packs a plush yet potent finish like a chocolate-coated cannonball."
    },
    "735": {
        "name": "Lewis Cellars Cuvee L Cabernet Sauvignon 2015",
        "grape": null,
        "region": "Napa Valley, California",
        "variety": "Red Wine",
        "rating": 96.0,
        "notes": "Straight from James Fenimore Cooper’s novel, Last of the Mohicans, comes our 2015 Cuvee L – a noble savage from an outstanding vintage with great depth of character. 100% Cabernet Sauvignon with the strength of a grizzly and the soul of a chief this onyx and indigo wine is cloaked in tiers of blackberry with a quiver of clove and cedary oak spices. Broad paths of richly rendered fruit trail into hand-hewn tannins reflecting nature’s winding ways."
    },
    "754": {
        "name": "Lewis Cellars Reserve Cabernet Sauvignon 2006",
        "grape": null,
        "region": "Napa Valley, California",
        "variety": "Red Wine",
        "rating": 95.0,
        "notes": "Seductive, sleek and serious best describe our 2006 Reserve Cabernet Sauvignon. 96% Cabernet and 4% Cabernet Franc, this opulent wine is crafted from Pritchard Hill, Calistoga, Rutherford and Oak Knoll hillside vineyards. Cedary sweet oak spice, black fruit and cocoa aromas are potent. On entry the wine is deeply fruited, plush and round with kirsch, café mocha and blackberry flavors supporting very supple, fine-grained tannins and delivering great texture and length."
    },
    "755": {
        "name": "Lewis Cellars Reserve Cabernet Sauvignon 2007",
        "grape": null,
        "region": "Napa Valley, California",
        "variety": "Red Wine",
        "rating": 95.0,
        "notes": "From the exceptional 2007 vintage, with production down 15% from 2006, we have crafted a densely woven, deeply fruited Reserve Cabernet rooted in Pritchard Hill, Calistoga, Rutherford and Oak Knoll hillside vineyards. Broad-shouldered and muscular, this blend of 97% Cabernet Sauvignon and 3% Cabernet Franc is packed with black currants and berries, dark chocolate, espresso, and sweet cedar and oak spice. Thickly textured on a massive scale with saturated fruit and sinewy tannins, this wine will stand tall for many years. 1,700 cases produced."
    },
    "758": {
        "name": "Lewis Cellars Reserve Cabernet Sauvignon 2010",
        "grape": null,
        "region": "Napa Valley, California",
        "variety": "Red Wine",
        "rating": 96.0,
        "notes": null
    },
    "761": {
        "name": "Lewis Cellars Reserve Cabernet Sauvignon 2014",
        "grape": null,
        "region": "Napa Valley, California",
        "variety": "Red Wine",
        "rating": 95.0,
        "notes": "The best qualities from our past two vintages come together like yin and yang in our singular 2014 Reserve Cabernet.  Radiant color and soaring aromas of ripe blackberry, toasty oak spices, black truffle and cappuccino make an impressive entrée.  Fleshy and supple at first, the wine expands into deeper, more concentrated fruit layers with chocolaty, fine-grained tannins."
    },
    "763": {
        "name": "Lewis Cellars Reserve Cabernet Sauvignon (scuffed labels) 2012",
        "grape": null,
        "region": "Napa Valley, California",
        "variety": "Red Wine",
        "rating": 96.0,
        "notes": "The headline reads: \"2012 Reserve Cabernet - Return of the Big Block\". Running on high octane aromas and built on an iron block with deep reserves of black fruit this 100% Cabernet blend delivers 700 horsepower at the wheels. Coming off idle the nose slowly explodes with sappy dark and rustic berries, clove, cedar and sweet oak spices. Forged, ripe fruit pistons pump out the power for miles until finally finishing with an impressive band of ported and polished tannins. Motor must be warmed-up before driving!"
    }
}